Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6585.PIC
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF1SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF1SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF05">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF1EID16" edc:desc="" edc:mask="0x1" edc:name="RXF1EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID17" edc:desc="" edc:mask="0x1" edc:name="RXF1EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF1EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF1EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF1SID0" edc:desc="" edc:mask="0x1" edc:name="RXF1SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1SID1" edc:desc="" edc:mask="0x1" edc:name="RXF1SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1SID2" edc:desc="" edc:mask="0x1" edc:name="RXF1SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF06">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF1EID8" edc:desc="" edc:mask="0x1" edc:name="RXF1EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID9" edc:desc="" edc:mask="0x1" edc:name="RXF1EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID10" edc:desc="" edc:mask="0x1" edc:name="RXF1EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID11" edc:desc="" edc:mask="0x1" edc:name="RXF1EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID12" edc:desc="" edc:mask="0x1" edc:name="RXF1EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID13" edc:desc="" edc:mask="0x1" edc:name="RXF1EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID14" edc:desc="" edc:mask="0x1" edc:name="RXF1EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID15" edc:desc="" edc:mask="0x1" edc:name="RXF1EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF07">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF1EID0" edc:desc="" edc:mask="0x1" edc:name="RXF1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID1" edc:desc="" edc:mask="0x1" edc:name="RXF1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID2" edc:desc="" edc:mask="0x1" edc:name="RXF1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID3" edc:desc="" edc:mask="0x1" edc:name="RXF1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID4" edc:desc="" edc:mask="0x1" edc:name="RXF1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID5" edc:desc="" edc:mask="0x1" edc:name="RXF1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID6" edc:desc="" edc:mask="0x1" edc:name="RXF1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF1EID7" edc:desc="" edc:mask="0x1" edc:name="RXF1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
