Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u0000000" edc:name="PORTF" edc:nzwidth="0x8" edc:por="x0000000" edc:_addr="0xF85">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN5" edc:desc="" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN6" edc:desc="" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN7" edc:desc="" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SS" edc:desc="" edc:mask="0x1" edc:name="SS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUTF" edc:desc="" edc:mask="0x1" edc:name="C2OUTF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUTF" edc:desc="" edc:mask="0x1" edc:name="C1OUTF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CVREFF" edc:desc="" edc:mask="0x1" edc:name="CVREFF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rnnnnn" edc:cname="PORTG" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="PORTG" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0xF86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG4" edc:desc="" edc:mask="0x1" edc:name="RG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG5" edc:desc="" edc:mask="0x1" edc:name="RG5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CANTX1" edc:desc="" edc:mask="0x1" edc:name="CANTX1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANTX2" edc:desc="" edc:mask="0x1" edc:name="CANTX2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANRX" edc:desc="" edc:mask="0x1" edc:name="CANRX" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="P1D" edc:desc="" edc:mask="0x1" edc:name="P1D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MCLR" edc:desc="" edc:mask="0x1" edc:name="MCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="C3OUTG" edc:desc="" edc:mask="0x1" edc:name="C3OUTG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RJPU" edc:desc="" edc:mask="0x1" edc:name="RJPU" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xF87"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xF89">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LA0" edc:desc="" edc:mask="0x1" edc:name="LA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA1" edc:desc="" edc:mask="0x1" edc:name="LA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA2" edc:desc="" edc:mask="0x1" edc:name="LA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA3" edc:desc="" edc:mask="0x1" edc:name="LA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA4" edc:desc="" edc:mask="0x1" edc:name="LA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA5" edc:desc="" edc:mask="0x1" edc:name="LA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA6" edc:desc="" edc:mask="0x1" edc:name="LA6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LB0" edc:desc="" edc:mask="0x1" edc:name="LB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB1" edc:desc="" edc:mask="0x1" edc:name="LB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB2" edc:desc="" edc:mask="0x1" edc:name="LB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB3" edc:desc="" edc:mask="0x1" edc:name="LB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB4" edc:desc="" edc:mask="0x1" edc:name="LB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB5" edc:desc="" edc:mask="0x1" edc:name="LB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB6" edc:desc="" edc:mask="0x1" edc:name="LB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB7" edc:desc="" edc:mask="0x1" edc:name="LB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
